# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_key_vault_certificate.vpn: Reading...
data.azurerm_key_vault_certificate.vpn: Read complete after 0s [id=https://kvaltinnauth001hub.vault.azure.net/certificates/VPNRootCert/dc43a0f1e5e549cf845744cc5085f007]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_dashboard_grafana.grafana will be created
  + resource "azurerm_dashboard_grafana" "grafana" {
      + api_key_enabled                        = false
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = false
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "11"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "norwayeast"
      + name                                   = "grafanaaltinnauth001hub"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "rgaltinnauth001hub"
      + sku                                    = "Standard"
      + zone_redundancy_enabled                = false

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_role_assignment.grafana_admin["3863fbc0-a24b-42bf-af3d-f45111814457"] will be created
  + resource "azurerm_role_assignment" "grafana_admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3863fbc0-a24b-42bf-af3d-f45111814457"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.grafana_admin["48587eaa-8f33-43ed-a0c3-108c3681e84b"] will be created
  + resource "azurerm_role_assignment" "grafana_admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "48587eaa-8f33-43ed-a0c3-108c3681e84b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.grafana_admin["93bed750-6ca4-47ae-ac43-b45fff4930f6"] will be created
  + resource "azurerm_role_assignment" "grafana_admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "93bed750-6ca4-47ae-ac43-b45fff4930f6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.grafana_admin["a9585a64-20f0-4d18-aba6-9930f92b809c"] will be created
  + resource "azurerm_role_assignment" "grafana_admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9585a64-20f0-4d18-aba6-9930f92b809c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.grafana_admin["be1a510a-db1e-473c-a73a-558cdb68e353"] will be created
  + resource "azurerm_role_assignment" "grafana_admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "be1a510a-db1e-473c-a73a-558cdb68e353"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.grafana_editors["c410f062-def4-44f5-9a45-b23ddcdd57c3"] will be created
  + resource "azurerm_role_assignment" "grafana_editors" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c410f062-def4-44f5-9a45-b23ddcdd57c3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Editor"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/hub` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/prod/hub.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_prod_hub.tfstate.tfplan`